{
  "class_name": "Model",
  "config": {
    "name": "face_net",
    "layers": [
      {
        "name": "input_1",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            198,
            198,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_1"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv2d_1",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_1",
          "trainable": true,
          "filters": 16,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_4",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_4",
          "trainable": true,
          "filters": 16,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_7",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_7",
          "trainable": true,
          "filters": 16,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_1",
        "class_name": "Activation",
        "config": {
          "name": "activation_1",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_5",
        "class_name": "Activation",
        "config": {
          "name": "activation_5",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_9",
        "class_name": "Activation",
        "config": {
          "name": "activation_9",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_1",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_5",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_5",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_9",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_9",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_1",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_1",
          "trainable": true,
          "pool_size": [
            3,
            3
          ],
          "padding": "valid",
          "strides": [
            3,
            3
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_4",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_4",
          "trainable": true,
          "pool_size": [
            3,
            3
          ],
          "padding": "valid",
          "strides": [
            3,
            3
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_7",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_7",
          "trainable": true,
          "pool_size": [
            3,
            3
          ],
          "padding": "valid",
          "strides": [
            3,
            3
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_1",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_1",
          "trainable": true,
          "rate": 0.25,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_5",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_5",
          "trainable": true,
          "rate": 0.25,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_9",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_9",
          "trainable": true,
          "rate": 0.25,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_2",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_2",
          "trainable": true,
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_5",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_5",
          "trainable": true,
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_8",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_8",
          "trainable": true,
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_2",
        "class_name": "Activation",
        "config": {
          "name": "activation_2",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_6",
        "class_name": "Activation",
        "config": {
          "name": "activation_6",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_10",
        "class_name": "Activation",
        "config": {
          "name": "activation_10",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_2",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_6",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_6",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_10",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_10",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_2",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_2",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_5",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_5",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_8",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_8",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_2",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_2",
          "trainable": true,
          "rate": 0.25,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_6",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_6",
          "trainable": true,
          "rate": 0.25,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_10",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_10",
          "trainable": true,
          "rate": 0.25,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_3",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_3",
          "trainable": true,
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_6",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_6",
          "trainable": true,
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_9",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_9",
          "trainable": true,
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_3",
        "class_name": "Activation",
        "config": {
          "name": "activation_3",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_7",
        "class_name": "Activation",
        "config": {
          "name": "activation_7",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_11",
        "class_name": "Activation",
        "config": {
          "name": "activation_11",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_3",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_3",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_7",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_7",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_11",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_11",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_3",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_3",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_6",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_6",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "max_pooling2d_9",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_9",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_3",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_3",
          "trainable": true,
          "rate": 0.25,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_7",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_7",
          "trainable": true,
          "rate": 0.25,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_11",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_11",
          "trainable": true,
          "rate": 0.25,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "max_pooling2d_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "flatten_1",
        "class_name": "Flatten",
        "config": {
          "name": "flatten_1",
          "trainable": true,
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "dropout_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "flatten_2",
        "class_name": "Flatten",
        "config": {
          "name": "flatten_2",
          "trainable": true,
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "dropout_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "flatten_3",
        "class_name": "Flatten",
        "config": {
          "name": "flatten_3",
          "trainable": true,
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "dropout_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_1",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "units": 128,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "flatten_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_3",
        "class_name": "Dense",
        "config": {
          "name": "dense_3",
          "trainable": true,
          "units": 128,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "flatten_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_5",
        "class_name": "Dense",
        "config": {
          "name": "dense_5",
          "trainable": true,
          "units": 128,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "flatten_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_4",
        "class_name": "Activation",
        "config": {
          "name": "activation_4",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "dense_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_8",
        "class_name": "Activation",
        "config": {
          "name": "activation_8",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "dense_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_12",
        "class_name": "Activation",
        "config": {
          "name": "activation_12",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "dense_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_4",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_4",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_8",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_8",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_12",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_12",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "activation_12",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_4",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_4",
          "trainable": true,
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_8",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_8",
          "trainable": true,
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_12",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_12",
          "trainable": true,
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_12",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_2",
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "units": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_4",
        "class_name": "Dense",
        "config": {
          "name": "dense_4",
          "trainable": true,
          "units": 5,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_6",
        "class_name": "Dense",
        "config": {
          "name": "dense_6",
          "trainable": true,
          "units": 2,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_12",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "age_output",
        "class_name": "Activation",
        "config": {
          "name": "age_output",
          "trainable": true,
          "activation": "linear"
        },
        "inbound_nodes": [
          [
            [
              "dense_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "race_output",
        "class_name": "Activation",
        "config": {
          "name": "race_output",
          "trainable": true,
          "activation": "softmax"
        },
        "inbound_nodes": [
          [
            [
              "dense_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "gender_output",
        "class_name": "Activation",
        "config": {
          "name": "gender_output",
          "trainable": true,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "dense_6",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_1",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "age_output",
        0,
        0
      ],
      [
        "race_output",
        0,
        0
      ],
      [
        "gender_output",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.2.4",
  "backend": "tensorflow"
}